# 1. Creating the Employees Table

In [ ]:
CREATE TABLE employees (
    emp_id INTEGER NOT NULL PRIMARY KEY,
    emp_name TEXT NOT NULL,
    age INTEGER CHECK (age >= 18),
    email TEXT UNIQUE,
    salary DECIMAL DEFAULT 30000
);

# 2. Purpose of Constraints and Data Integrity

Constraints enforce rules on data columns to maintain accuracy and reliability in a database. They prevent invalid data entry and help preserve relationships between tables.

Common Constraint Types:
NOT NULL - Ensures a column cannot have NULL values

UNIQUE - Guarantees all values in a column are different

PRIMARY KEY - Uniquely identifies each record (NOT NULL + UNIQUE)

FOREIGN KEY - Maintains referential integrity between tables

CHECK - Validates that values meet specific conditions

DEFAULT - Sets a default value when none is specified

Example: A CHECK constraint on age (age >= 18) prevents hiring underage employees.

# 3.NOT NULL Constraint and Primary Keys

NOT NULL ensures a column must always contain a value, preventing missing data. This is essential for critical fields like employee IDs or names.

Primary keys cannot contain NULL values because:

They must uniquely identify each record

NULL represents unknown/undefined data which violates uniqueness

Database engines enforce this automatically (PRIMARY KEY implies NOT NULL)

# 4. Adding/Removing Constraints

In [ ]:
ALTER TABLE products
ADD CONSTRAINT pk_product PRIMARY KEY (product_id);

ALTER TABLE products
ALTER COLUMN price SET DEFAULT 50.00;

In [ ]:
# removing constraints
ALTER TABLE products
DROP CONSTRAINT pk_product;

ALTER TABLE products
ALTER COLUMN price DROP DEFAULT;

# 5. Constraint Violation Consequences

Attempting to violate constraints results in errors that abort the operation:

Example Violations:

Inserting NULL into a NOT NULL column

Duplicating a PRIMARY KEY value

Violating a CHECK constraint

Example Error:

ERROR: duplicate key value violates unique constraint "employees_email_key"

DETAIL: Key (email)=(john@example.com) already exists.

# 6. Adding Constraints to Products Table

In [ ]:
-- Add primary key constraint
ALTER TABLE products
ADD CONSTRAINT pk_product PRIMARY KEY (product_id);

-- Add default value for price
ALTER TABLE products
ALTER COLUMN price SET DEFAULT 50.00;

# 7. You have two tables

In [ ]:
SELECT 
    s.student_name,
    c.class_name
FROM 
    student_class s
INNER JOIN 
    classes c ON s.class_id = c.class_id;

# 8. You have three tables

In [ ]:
SELECT 
    o.order_id,
    c.customer_name,
    p.product_name
FROM 
    products p
LEFT JOIN 
    order_details od ON p.product_id = od.product_id
LEFT JOIN 
    orders o ON od.order_id = o.order_id
LEFT JOIN 
    customers c ON o.customer_id = c.customer_id;

# 9 Given the following tables:

In [ ]:
SELECT 
    p.product_id,
    p.product_name,
    SUM(s.amount) AS total_sales_amount
FROM 
    products p
INNER JOIN 
    sales s ON p.product_id = s.product_id
GROUP BY 
    p.product_id, p.product_name
ORDER BY 
    total_sales_amount DESC;

# 10. Write a query to display the order_id, customer_name, and the quantity of products ordered by each customer using an INNER JOIN between all three tables.

In [ ]:
SELECT 
    o.order_id,
    c.customer_name,
    SUM(od.quantity) AS total_products_ordered
FROM 
    orders o
INNER JOIN 
    customers c ON o.customer_id = c.customer_id
INNER JOIN 
    order_details od ON o.order_id = od.order_id
GROUP BY 
    o.order_id, c.customer_name
ORDER BY 
    o.order_id;

# SQL Commands

# 1. Primary Keys and Foreign Keys

Primary Keys: These are unique identifiers for each record in a table. For example, in common movie databases, you might have:

customer_id in the Customers table

actor_id in the Actors table

film_id in the Films table

Foreign Keys: These reference primary keys in another table and are used to establish relationships between tables. For example:

customer_id in the Rentals table (refers to the Customers table)
film_id in the Rentals table (refers to the Films table)

# 2. List all details of actors

In [ ]:
SELECT * FROM actors;

# 3. List all customer information from DB

In [ ]:
SELECT * FROM customers;

# 4. List different countries

In [ ]:
SELECT DISTINCT country FROM customers;  -- Assuming customers table has a country field

# 5. Display all active customers

In [ ]:
SELECT * FROM customers WHERE status = 'active';  -- Assuming there is a status field

# 6. List all rental IDs for customer with ID 1

In [ ]:
SELECT rental_id FROM rentals WHERE customer_id = 1;

# 7. Display all the films whose rental duration is greater than 5

In [ ]:
SELECT * FROM films WHERE rental_duration > 5;

# 8. List the total number of films whose replacement cost is greater than $15 and less than $20

In [ ]:
SELECT COUNT(*) FROM films WHERE replacement_cost > 15 AND replacement_cost < 20;

# 9. Display the count of unique first names of actors

In [ ]:
SELECT COUNT(DISTINCT first_name) FROM actors;

# 10. Display the first 10 records from the customer table

In [ ]:
SELECT * FROM customers LIMIT 10;

# 11. Display the first 3 records from the customer table whose first name starts with ‘b’

In [ ]:
SELECT * FROM customers WHERE first_name LIKE 'b%' LIMIT 3;

# 12. Display the names of the first 5 movies which are rated as ‘G’

In [ ]:
SELECT title FROM films WHERE rating = 'G' LIMIT 5;

# 13. Find all customers whose first name starts with "a"

In [ ]:
SELECT * FROM customers WHERE first_name LIKE 'a%';

# 14. Find all customers whose first name ends with "a"

In [ ]:
SELECT * FROM customers WHERE first_name LIKE '%a';

# 15. Display the list of first 4 cities which start and end with ‘a’

In [ ]:
SELECT DISTINCT city FROM customers WHERE city LIKE 'a%' AND city LIKE '%a' LIMIT 4;

# 16. Find all customers whose first name has "NI" in any position

In [ ]:
SELECT * FROM customers WHERE first_name LIKE '%NI%';

# 17. Find all customers whose first name has "r" in the second position

In [ ]:
SELECT * FROM customers WHERE first_name LIKE '_r%';

# 18. Find all customers whose first name starts with "a" and are at least 5 characters in length

In [ ]:
SELECT * FROM customers WHERE first_name LIKE 'a%' AND LENGTH(first_name) >= 5;

# 19. Find all customers whose first name starts with "a" and ends with "o"

In [ ]:
SELECT * FROM customers WHERE first_name LIKE 'a%o';

# 20. Get the films with pg and pg-13 rating using IN operator

In [ ]:
SELECT * FROM films WHERE rating IN ('PG', 'PG-13');

# 21. Get the films with length between 50 to 100 using BETWEEN operator

In [ ]:
SELECT * FROM films WHERE length BETWEEN 50 AND 100;

# 22. Get the top 50 actors using LIMIT operator

In [ ]:
SELECT * FROM actors LIMIT 50;

# 23. Get the distinct film ids from inventory table

In [ ]:
SELECT DISTINCT film_id FROM inventory;

# Functions

# Basic Aggregate Functions:

# Question 1: Retrieve the total number of rentals made in the Sakila database.

In [ ]:
SELECT COUNT(*) AS total_rentals FROM rental;

# Question 2: Find the average rental duration (in days) of movies rented from the Sakila database.

In [ ]:
SELECT AVG(rental_duration) AS average_rental_duration FROM film;

# Question 3: Display the first name and last name of customers in uppercase.

In [ ]:
SELECT UPPER(first_name) AS first_name, UPPER(last_name) AS last_name FROM customer;

# Question 4: Extract the month from the rental date and display it alongside the rental ID.

In [ ]:
SELECT rental_id, MONTH(rental_date) AS rental_month FROM rental;

# Question 5: Retrieve the count of rentals for each customer (display customer ID and the count of rentals).

In [ ]:
SELECT customer_id, COUNT(rental_id) AS rental_count 
FROM rental 
GROUP BY customer_id;

# Question 6: Find the total revenue generated by each store.

In [ ]:
SELECT store_id, SUM(amount) AS total_revenue 
FROM payment 
GROUP BY store_id;

# Question 7: Determine the total number of rentals for each category of movies.

In [ ]:
SELECT c.category_id, COUNT(r.rental_id) AS rental_count
FROM rental r
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film_category fc ON i.film_id = fc.film_id
JOIN category c ON fc.category_id = c.category_id
GROUP BY c.category_id;

# Question 8: Find the average rental rate of movies in each language.

In [ ]:
SELECT l.language_id, AVG(f.rental_rate) AS average_rental_rate
FROM film f
JOIN language l ON f.language_id = l.language_id
GROUP BY l.language_id;

# Question 9: Display the title of the movie, customer's first name, and last name who rented it.

In [ ]:
SELECT f.title, c.first_name, c.last_name
FROM film f
JOIN inventory i ON f.film_id = i.film_id
JOIN rental r ON i.inventory_id = r.inventory_id
JOIN customer c ON r.customer_id = c.customer_id;

# Question 10: Retrieve the names of all actors who have appeared in the film "Gone with the Wind."

In [ ]:
SELECT a.first_name, a.last_name
FROM actor a
JOIN film_actor fa ON a.actor_id = fa.actor_id
JOIN film f ON fa.film_id = f.film_id
WHERE f.title = 'Gone with the Wind';

# Question 11: Retrieve the customer names along with the total amount they've spent on rentals.

In [ ]:
SELECT c.first_name, c.last_name, SUM(p.amount) AS total_spent
FROM customer c
JOIN payment p ON c.customer_id = p.customer_id
JOIN rental r ON p.rental_id = r.rental_id
GROUP BY c.customer_id;

# Question 12: List the titles of movies rented by each customer in a particular city (e.g., 'London').

In [ ]:
SELECT c.first_name, c.last_name, f.title
FROM customer c
JOIN address a ON c.address_id = a.address_id
JOIN city ci ON a.city_id = ci.city_id
JOIN rental r ON c.customer_id = r.customer_id
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film f ON i.film_id = f.film_id
WHERE ci.city = 'London';  -- You can change 'London' to any desired city.

# Advanced Joins and GROUP BY:

# Question 13:

# Display the top 5 rented movies along with the number of times they've been rented.

In [ ]:
SELECT f.title, COUNT(r.rental_id) AS rental_count
FROM film f
JOIN inventory i ON f.film_id = i.film_id
JOIN rental r ON i.inventory_id = r.inventory_id
GROUP BY f.film_id, f.title
ORDER BY rental_count DESC
LIMIT 5;

# Question 14: Determine the customers who have rented movies from both stores (store ID 1 and store ID 2).

In [ ]:
SELECT c.customer_id, c.first_name, c.last_name
FROM customer c
JOIN rental r ON c.customer_id = r.customer_id
JOIN inventory i ON r.inventory_id = i.inventory_id
WHERE i.store_id IN (1, 2)
GROUP BY c.customer_id, c.first_name, c.last_name
HAVING COUNT(DISTINCT i.store_id) = 2;  -- Counts distinct store IDs rented from

# Windows Function:

# 1. Rank the customers based on the total amount they've spent on rentals.

In [ ]:
SELECT c.customer_id, c.first_name, c.last_name, 
       SUM(p.amount) AS total_spent,
       RANK() OVER (ORDER BY SUM(p.amount) DESC) AS rank
FROM customer c
JOIN payment p ON c.customer_id = p.customer_id
GROUP BY c.customer_id
ORDER BY rank;

# 2. Calculate the cumulative revenue generated by each film over time.

In [ ]:
SELECT f.film_id, f.title,
       SUM(p.amount) OVER (PARTITION BY f.film_id ORDER BY r.rental_date ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW) AS cumulative_revenue
FROM film f
JOIN inventory i ON f.film_id = i.film_id
JOIN rental r ON i.inventory_id = r.inventory_id
JOIN payment p ON r.rental_id = p.rental_id;

# 3. Determine the average rental duration for each film, considering films with similar lengths.

In [ ]:
SELECT f.film_id, f.title,
       AVG(f.rental_duration) AS average_rental_duration
FROM film f
GROUP BY f.film_id
ORDER BY average_rental_duration;

# 4. Identify the top 3 films in each category based on their rental counts.

In [ ]:
WITH RankedFilms AS (
    SELECT f.film_id, f.title, c.category_id, 
           COUNT(r.rental_id) AS rental_count,
           RANK() OVER (PARTITION BY c.category_id ORDER BY COUNT(r.rental_id) DESC) AS rank
    FROM film f
    JOIN inventory i ON f.film_id = i.film_id
    JOIN rental r ON i.inventory_id = r.inventory_id
    JOIN film_category fc ON f.film_id = fc.film_id
    JOIN category c ON fc.category_id = c.category_id
    GROUP BY f.film_id, c.category_id
)
SELECT film_id, title, category_id, rental_count
FROM RankedFilms
WHERE rank <= 3;

# 5. Calculate the difference in rental counts between each customer's total rentals and the average rentals across all customers using window function.

In [ ]:
WITH CustomerRentals AS (
    SELECT c.customer_id, COUNT(r.rental_id) AS total_rentals
    FROM customer c
    JOIN rental r ON c.customer_id = r.customer_id
    GROUP BY c.customer_id
),
AverageRentals AS (
    SELECT AVG(total_rentals) AS avg_rentals
    FROM CustomerRentals
)
SELECT cr.customer_id, cr.total_rentals,
       cr.total_rentals - ar.avg_rentals AS rental_difference
FROM CustomerRentals cr
CROSS JOIN AverageRentals ar;

# 6. Find the monthly revenue trend for the entire rental store over time.

In [ ]:
SELECT DATE_FORMAT(p.payment_date, '%Y-%m') AS month, 
       SUM(p.amount) AS monthly_revenue
FROM payment p
GROUP BY month
ORDER BY month;

# 7. Identify the customers whose total spending on rentals falls within the top 20% of all customers.

In [ ]:
WITH CustomerSpending AS (
    SELECT c.customer_id, SUM(p.amount) AS total_spent
    FROM customer c
    JOIN payment p ON c.customer_id = p.customer_id
    GROUP BY c.customer_id
),
SpendingThreshold AS (
    SELECT PERCENTILE_CONT(0.8) WITHIN GROUP (ORDER BY total_spent) AS threshold
    FROM CustomerSpending
)
SELECT cs.customer_id, cs.total_spent
FROM CustomerSpending cs
JOIN SpendingThreshold st ON cs.total_spent >= st.threshold;

# 8. Calculate the running total of rentals per category, ordered by rental count.

In [ ]:
SELECT c.category_id, COUNT(r.rental_id) AS rental_count,
       SUM(COUNT(r.rental_id)) OVER (PARTITION BY c.category_id ORDER BY COUNT(r.rental_id) ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW) AS running_total
FROM rental r
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film_category fc ON i.film_id = fc.film_id
JOIN category c ON fc.category_id = c.category_id
GROUP BY c.category_id
ORDER BY rental_count DESC;

# 9. Find the films that have been rented less than the average rental count for their respective categories.

In [ ]:
WITH CategoryRentalCounts AS (
    SELECT c.category_id, f.film_id, COUNT(r.rental_id) AS rental_count
    FROM film f
    JOIN inventory i ON f.film_id = i.film_id
    JOIN rental r ON i.inventory_id = r.inventory_id
    JOIN film_category fc ON f.film_id = fc.film_id
    JOIN category c ON fc.category_id = c.category_id
    GROUP BY c.category_id, f.film_id
),
AverageRentalCounts AS (
    SELECT category_id, AVG(rental_count) AS avg_rental_count
    FROM CategoryRentalCounts
    GROUP BY category_id
)
SELECT crc.film_id
FROM CategoryRentalCounts crc
JOIN AverageRentalCounts arc ON crc.category_id = arc.category_id
WHERE crc.rental_count < arc.avg_rental_count;

# 10. Identify the top 5 months with the highest revenue and display the revenue generated in each month.

In [ ]:
SELECT DATE_FORMAT(p.payment_date, '%Y-%m') AS month, 
       SUM(p.amount) AS total_revenue
FROM payment p
GROUP BY month
ORDER BY total_revenue DESC
LIMIT 5;

# Normalisation & CTE

# 1. First Normal Form (1NF):

 # a. Identify a table in the Sakila database that violates 1NF. Explain how you

 # would normalize it to achieve 1NF.

In [ ]:
A table that can violate 1NF is the film table if, for example, it contains a list of actors as a single field instead of having a separate row for each actor.

To achieve 1NF:

Normalization Steps:

Separate multi-valued fields into separate rows. Each field should contain atomic values.

Example: If film_id 1 has a field value of "Actor A, Actor B, Actor C", it should be represented in multiple rows:


film_id | actor_name

---------|-----------

1       | Actor A

1       | Actor B

1       | Actor C

# 2. Second Normal Form (2NF):a. Choose a table in Sakila and describe how you would determine whether it is in 2NF. If it violates 2NF, explain the steps to normalize it.

In [ ]:
Table: film_actor

This table typically connects film and actor with film_id and actor_id.
To determine if film_actor is in 2NF:

Check for partial dependencies — if a non-prime attribute relies only on part of a composite primary key. If film_actor has just film_id and actor_id as the composite key, then there shouldn’t be any other attributes in the table based on either film_id or actor_id.
If there are attributes dependent only on film_id (e.g., film_title), then it violates 2NF.

To normalize:

Create separate tables to eliminate partial dependencies:
Keep film_actor for relationships and move any attributes dependent only on film_id or actor_id to film or actor tables, respectively.

# 3. Third Normal Form (3NF): a. Identify a table in Sakila that violates 3NF. Describe the transitive dependencies present and outline the steps to normalize the table to 3NF.

In [ ]:
Table: customer

Suppose it contains customer_id, address_id, city, and country.
Transitive dependencies:

If city and country are non-key attributes that depend on address_id, which in turn depends on customer_id, then city and country create transitive dependencies.
To normalize to 3NF:

Remove transitive dependencies.
Create a separate address table:
Fields: address_id, city, country.
Keep customer to only have attributes directly related to the customer, linking to address by address_id.

# 4. Normalization Process: a. Take a specific table in Sakila and guide through the process of normalizing it from the initial unnormalized form up to at least 2NF.

In [ ]:
Table: rental
Initial Unnormalized Form (example):

Copy
rental_id | rental_date | customer_name | film_title | actor_names
---------- | ------------| --------------| -----------| -------------
1          | 2023-01-01 | John Doe      | Movie1     | Actor A, Actor B
Steps to Normalize to 1NF:

Separate actor_names into multiple rows:
Copy
rental_id | rental_date | customer_name | film_title | actor_name
---------- | ------------| --------------| -----------| -------------
1          | 2023-01-01 | John Doe      | Movie1     | Actor A
1          | 2023-01-01 | John Doe      | Movie1     | Actor B
Steps to Normalize to 2NF:

Identify partial dependencies. If you have film_title depending on rental_id, you should create a film table.
Extract film-related fields into a separate table:
Copy
film_id | film_title
---------|-----------
1       | Movie1
The rental table will later only have rental_id, rental_date, customer_name, film_id.

# 5. CTE Basics: a. Write a query using a CTE to retrieve the distinct list of actor names and the number of films they have acted in from the actor and film_actor tables.

In [ ]:
WITH ActorFilmCount AS (
    SELECT a.first_name, a.last_name, COUNT(fa.film_id) AS film_count
    FROM actor a
    JOIN film_actor fa ON a.actor_id = fa.actor_id
    GROUP BY a.first_name, a.last_name
)
SELECT DISTINCT first_name, last_name, film_count
FROM ActorFilmCount;

# 6. CTE with Joins: a. Create a CTE that combines information from the film and language tables to display the film title, language name, and rental rate.

In [ ]:
WITH FilmLanguage AS (
    SELECT f.title, l.name AS language_name, f.rental_rate
    FROM film f
    JOIN language l ON f.language_id = l.language_id
)
SELECT * FROM FilmLanguage;

# 7. CTE for Aggregation: a. Write a query using a CTE to find the total revenue generated by each customer (sum of payments) from the customer and payment tables.

In [ ]:
WITH CustomerRevenue AS (
    SELECT c.customer_id, c.first_name, c.last_name, SUM(p.amount) AS total_revenue
    FROM customer c
    JOIN payment p ON c.customer_id = p.customer_id
    GROUP BY c.customer_id, c.first_name, c.last_name
)
SELECT * FROM CustomerRevenue;

# 8. CTE with Window Functions: a. Utilize a CTE with a window function to rank films based on their rental duration from the film table.

In [ ]:
WITH FilmRanks AS (
    SELECT f.film_id, f.title, f.rental_duration,
           RANK() OVER (ORDER BY f.rental_duration DESC) AS rental_rank
    FROM film f
)
SELECT * FROM FilmRanks;

# 9. CTE and Filtering: a. Create a CTE to list customers who have made more than two rentals, and then join this CTE with the customer table to retrieve additional customer details.

In [ ]:
WITH FrequentCustomers AS (
    SELECT c.customer_id, c.first_name, c.last_name, COUNT(r.rental_id) AS rental_count
    FROM customer c
    JOIN rental r ON c.customer_id = r.customer_id
    GROUP BY c.customer_id, c.first_name, c.last_name
    HAVING COUNT(r.rental_id) > 2
)
SELECT fc.customer_id, fc.first_name, fc.last_name
FROM FrequentCustomers fc;

# 10. CTE for Date Calculations:  a. Write a query using a CTE to find the total number of rentals made each month, considering the rental_date from the rental table.

In [ ]:
WITH MonthlyRentals AS (
    SELECT DATE_FORMAT(rental_date, '%Y-%m') AS rental_month, COUNT(*) AS total_rentals
    FROM rental
    GROUP BY rental_month
)
SELECT rental_month, total_rentals
FROM MonthlyRentals
ORDER BY rental_month;

# 11. CTE and Self-Join: a. Create a CTE to generate a report showing pairs of actors who have appeared in the same film together using the film_actor table.

In [ ]:
WITH ActorPairs AS (
    SELECT fa1.actor_id AS actor1_id, fa2.actor_id AS actor2_id, f.title
    FROM film_actor fa1
    JOIN film_actor fa2 ON fa1.film_id = fa2.film_id AND fa1.actor_id < fa2.actor_id
    JOIN film f ON fa1.film_id = f.film_id
)
SELECT a1.first_name AS actor1_first_name, a1.last_name AS actor1_last_name,
       a2.first_name AS actor2_first_name, a2.last_name AS actor2_last_name,
       p.title
FROM ActorPairs p
JOIN actor a1 ON p.actor1_id = a1.actor_id
JOIN actor a2 ON p.actor2_id = a2.actor_id
ORDER BY p.title, a1.first_name, a2.first_name;

# 12. CTE for Recursive Search : a. Implement a recursive CTE to find all employees in the staff table who report to a specific manager, considering the reports_to column.

In [ ]:
WITH RECURSIVE EmployeeHierarchy AS (
    SELECT staff_id, first_name, last_name, reports_to
    FROM staff
    WHERE reports_to = 1  -- Starting point (specific manager)

    UNION ALL

    SELECT s.staff_id, s.first_name, s.last_name, s.reports_to
    FROM staff s
    JOIN EmployeeHierarchy eh ON s.reports_to = eh.staff_id
)
SELECT staff_id, first_name, last_name
FROM EmployeeHierarchy;